Revit 2026 API

# ParameterTypeIdRbsEnergyAnalysisViewInnerShellMode Property

---

"Show Inner Space Shells"

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ForgeTypeId RbsEnergyAnalysisViewInnerShellMode { get; }
```
```vb
Public Shared ReadOnly Property RbsEnergyAnalysisViewInnerShellMode As ForgeTypeId
	Get
```
```cpp
public:
static property ForgeTypeId^ RbsEnergyAnalysisViewInnerShellMode {
	ForgeTypeId^ get ();
}
```
```fsharp
static member RbsEnergyAnalysisViewInnerShellMode : ForgeTypeId with get
```

#### Property Value

ForgeTypeId

#### Reference

ParameterTypeId Class

Autodesk.Revit.DB Namespace